#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/common-eks/cluster]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-021da28e9e6d0515e]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Read complete after 0s [id=819195744]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_role.aws_ebs_csi_driver_assume_role: Refreshing state... [id=AmazonEBSCSIDriverRole]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20241227104928416300000001]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=common-eks-cluster-20241227104928418800000003]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-20241227104928416800000002]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::183631350996:assumed-role/IaC-ReadOnly/GitHubActions]
aws_iam_role_policy_attachment.test-attach: Refreshing state... [id=AmazonEBSCSIDriverRole-20241227104928759600000004]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=common-eks-cluster-20241227104928418800000003-20241227104928797000000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=common-eks-cluster-20241227104928418800000003-20241227104928804300000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=common-eks-cluster-20241227104928418800000003-2024122710492883550000000a]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20241227104928416300000001-20241227104928818800000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20241227104928416300000001-20241227104928835300000009]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20241227104928416300000001-20241227104928776300000005]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3601875887]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=2f85e302-0c5d-4ec7-ac5c-78ba3e1143af]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/common-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-ClusterEncryption20241227104949683100000010]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=common-eks-cluster-20241227104928418800000003-20241227104950008700000011]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b8872c088b6a2be2]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b2de6e6e43aa4729]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04e3b3bc80851c21d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-085068494393ca968]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0fba721ff3ee04a5f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-060debbd438febe81]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a6746651dd21c8ab]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d881ae364d2bcc24]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f56f1d2b204a1636]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c96f8e7bcc73b589]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-067b334e75c0d7e22]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0486dbd02c841c13f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-093e1adf7f01b2c76]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06b0054011a8b525f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02c1faa5dced59dec]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1904706962]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1437271937]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-4059341934]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-532639496]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1378339067]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3095867003]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1710378144]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3606907038]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-216224553]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1749180642]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2524418996]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06b0054011a8b525f1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0fbb692a74a91582f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4b638f119a00ffc]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06e12e7257b8b1406]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0c4daf8184dfe4d5c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-027e1764dba3a81ca]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e5cd7edfe8f63e91]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0002eae0ece63f948]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-060debbd438febe811080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=common-eks]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-27T10:59:43Z]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.aws_eks_access_entry.this["github_action_ci"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC]
module.eks.aws_eks_access_entry.this["root_user"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:root]
module.eks.aws_eks_access_entry.this["github_action_ci_read_only"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC-ReadOnly]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4318353186593865971]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0925330ebdfd820ef]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/4B66F8930B50EFF928B6AB2C5E1DC239]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=common-eks:default-20241227105948785700000015]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 1s [id=aws-ebs-csi-driver]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 1s [id=eks-pod-identity-agent]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=common-eks:vpc-cni]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=common-eks:kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=common-eks:coredns]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=common-eks:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=common-eks:aws-ebs-csi-driver]
module.eks.aws_eks_access_policy_association.this["root_user_root_user"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["github_action_ci_read_only_github_action_ci_read_only"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC-ReadOnly#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
module.eks.aws_eks_access_policy_association.this["github_action_ci_github_action_ci"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
data.aws_eks_cluster.eks: Reading...
data.aws_eks_cluster.eks: Read complete after 0s [id=common-eks]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "common-eks:default-20241227105948785700000015"
      + labels                 = {}
        tags                   = {
            "Name" = "default"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.12.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.strimzi_kafka_operator will be created
  + resource "helm_release" "strimzi_kafka_operator" {
      + atomic                     = false
      + chart                      = "strimzi-kafka-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "strimzi-operator"
      + namespace                  = "strimzi-operator"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://quay.io/strimzi-helm/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.45.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.strimzi_kafka_operator will be created
  + resource "kubernetes_namespace" "strimzi_kafka_operator" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "strimzi-operator"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "2f85e302-0c5d-4ec7-ac5c-78ba3e1143af"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:role/common-eks-cluster-20241227104928418800000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @yashrajdighe, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-plan`*